---
kind: property
id: P:Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentUsersAddinsDataFolderPath
source: html/f83ab5b7-4ab5-6e2f-565e-c3bf0e46e44e.htm
---
# Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentUsersAddinsDataFolderPath Property

Path to AddinsData folder for the current user.

## Syntax (C#)
```csharp
public string CurrentUsersAddinsDataFolderPath { get; }
```

## Remarks
Similar to C:\Users\[UserName]\AppData\Roaming\Autodesk\[ProductType]\[ReleaseName]\AddinsData